src/InformationRegisters/НастройкиОтправкиДокументовПоЭДО/НастройкиОтправкиДокументовПоЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОтправкиДокументовПоЭДО</name>
  <resources>
    <name>ВидДокументаЭДО</name>
    <type>
      <types>CatalogRef.ВидыДокументовЭДО</types>
    </type>
  </resources>
  <resources>
    <name>Отправлять</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяИзвещениеОПолучении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяОтветнаяПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВидЭД</name>
    <type>
      <types>EnumRef.ТипыДокументовЭДО</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТипЭД</name>
    <type>
      <types>EnumRef.УдалитьТипыПроизвольныхДокументовЭДО</types>
    </type>
  </resources>
  <resources>
    <name>Формат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.УчастникЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыДокументовЭДО/ТипыДокументовЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДокументовЭДО</name>
  <enumValues>
    <name>АктВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
  </enumValues>
  <enumValues>
    <name>АктОРасхождениях</name>
  </enumValues>
  <enumValues>
    <name>Внутренний</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТовара</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКоммерческихПредложений</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>КаталогТоваров</name>
  </enumValues>
  <enumValues>
    <name>КоммерческоеПредложение</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйСчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПродажахКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОСписанииКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеОператораЭДО</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛист</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>Прикладной</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимости</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ТоварнаяНакладная</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУточнении</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАктЗаказчик</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАктИсполнитель</name>
  </enumValues>
  <enumValues>
    <name>УдалитьВыпискаБанка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДопДанные</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросЗонд</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНаОтзывЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНочнойВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКвитанция</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОшибка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеТребование</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПроизвольный</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСоглашениеОбИзмененииСтоимостиПолучатель</name>
  </enumValues>
  <enumValues>
    <name>УдалитьТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>УдалитьТОРГ12Покупатель</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УКД</name>
  </enumValues>
  <enumValues>
    <name>УПД</name>
  </enumValues>
  <enumValues>
    <name>АктВзаимозачета</name>
  </enumValues>
  <enumValues>
    <name>АктСверки</name>
  </enumValues>
  <enumValues>
    <name>Ведомость</name>
  </enumValues>
  <enumValues>
    <name>ГарантийноеПисьмо</name>
  </enumValues>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСоглашение</name>
  </enumValues>
  <enumValues>
    <name>КС11</name>
  </enumValues>
  <enumValues>
    <name>КС2</name>
  </enumValues>
  <enumValues>
    <name>КС3</name>
  </enumValues>
  <enumValues>
    <name>Отчет</name>
  </enumValues>
  <enumValues>
    <name>ПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>ПриложениеКАкту</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбЭДО</name>
  </enumValues>
  <enumValues>
    <name>Спецификация</name>
  </enumValues>
  <enumValues>
    <name>Уведомление</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>РеквизитыОрганизации</name>
  </enumValues>
  <enumValues>
    <name>СведенияОРеализацииКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>СведенияОЗакупкеКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаСведенийОРеализацииКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаСведенийОЗакупкеКомиссионером</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/НастройкиОтправкиДокументовПоЭДО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработкаПереходаНаНовуюВерсию

Процедура ЗаполнитьВидДокументаЭДОВПравилахОтправки(Параметры) Экспорт
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.НастройкиОтправкиДокументовПоЭДО;
	ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
	
	Если ОбновлениеИнформационнойБазы.ЕстьЗаблокированныеПредыдущимиОчередямиДанные(Параметры.Очередь, "Справочник.ВидыДокументовЭДО") Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
			Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	ПараметрыОтметкиВыполнения = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиОтправкиДокументовПоЭДО.Отправитель,
	|	НастройкиОтправкиДокументовПоЭДО.Получатель,
	|	НастройкиОтправкиДокументовПоЭДО.ВидДокумента,
	|	НастройкиОтправкиДокументовПоЭДО.ВидДокументаЭДО,
	|	НастройкиОтправкиДокументовПоЭДО.УдалитьВидЭД,
	|	НастройкиОтправкиДокументовПоЭДО.УдалитьТипЭД
	|ИЗ
	|	РегистрСведений.НастройкиОтправкиДокументовПоЭДО КАК НастройкиОтправкиДокументовПоЭДО
	|ГДЕ
	|	НастройкиОтправкиДокументовПоЭДО.ВидДокументаЭДО = ЗНАЧЕНИЕ(Справочник.ВидыДокументовЭДО.ПустаяСсылка)
	|	И НастройкиОтправкиДокументовПоЭДО.УдалитьВидЭД <> ЗНАЧЕНИЕ(Перечисление.ТипыДокументовЭДО.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НастройкиОтправкиДокументовПоЭДО.Отправитель,
	|	НастройкиОтправкиДокументовПоЭДО.Получатель,
	|	НастройкиОтправкиДокументовПоЭДО.ВидДокумента,
	|	НастройкиОтправкиДокументовПоЭДО.ВидДокументаЭДО,
	|	НастройкиОтправкиДокументовПоЭДО.УдалитьВидЭД,
	|	НастройкиОтправкиДокументовПоЭДО.УдалитьТипЭД
	|ИЗ
	|	РегистрСведений.НастройкиОтправкиДокументовПоЭДО КАК НастройкиОтправкиДокументовПоЭДО
	|ГДЕ
	|	НастройкиОтправкиДокументовПоЭДО.ВидДокументаЭДО = ЗНАЧЕНИЕ(Справочник.ВидыДокументовЭДО.ПустаяСсылка)
	|	И НастройкиОтправкиДокументовПоЭДО.УдалитьВидЭД = ЗНАЧЕНИЕ(Перечисление.ТипыДокументовЭДО.ПустаяСсылка)
	|	И
	|		НастройкиОтправкиДокументовПоЭДО.УдалитьТипЭД <> ЗНАЧЕНИЕ(Перечисление.УдалитьТипыПроизвольныхДокументовЭДО.ПустаяСсылка)";
	
	ВыборкаДанных = Запрос.Выполнить().Выбрать();
	
	ОбъектовКОбработке = ВыборкаДанных.Количество();
	
	СоответствиеВидовДокументов = ОбменСКонтрагентамиИнтеграция.СоответствиеВидовЭДВидамДокументовЭДО();
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Пока ВыборкаДанных.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Записать = Ложь;
			
			НаборЗаписей = РегистрыСведений.НастройкиОтправкиДокументовПоЭДО.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Отправитель.Установить(ВыборкаДанных.Отправитель);
			НаборЗаписей.Отбор.Получатель.Установить(ВыборкаДанных.Получатель);
			НаборЗаписей.Отбор.ВидДокумента.Установить(ВыборкаДанных.ВидДокумента);
			ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(НаборЗаписей);
			
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() Тогда
				
				ЗаполнитьВидДокументаЭДОПриОбновлении(
					НаборЗаписей,
					СоответствиеВидовДокументов,
					Записать);
				
			КонецЕсли;
			
			Если Записать Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей, ПараметрыОтметкиВыполнения);
			КонецЕсли;
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось обработать настройки отправки документов по ЭДО для: %1 по причине:
				|%2'"), ВыборкаДанных.Отправитель, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка, МетаданныеОбъекта, ВыборкаДанных.Ссылка, ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ШаблонСообщения = НСтр("ru = 'Не удалось обработать некоторые настройки отправки по ЭДО (пропущены): %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ШаблонСообщения = НСтр("ru = 'Обработана очередная порция настроек отправки по ЭДО: %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектовОбработано);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			МетаданныеОбъекта,, ТекстСообщения);
	КонецЕсли;
	
	Параметры.ПрогрессВыполнения.ОбработаноОбъектов =
		Параметры.ПрогрессВыполнения.ОбработаноОбъектов + ОбъектовОбработано;
	
	Параметры.ОбработкаЗавершена = ОбъектовКОбработке <= ОбъектовОбработано;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает настройки отправи внутненних документов по ЭДО.
// 
// Параметры:
//   Организация - Справочник.Организации - Организация для которой необходимо получить правила отправки.
//   Контрагент - Справочник.Контрагенты - Контрагент правил.
// 
// Возвращаемое значение:
//  Таблица значений:
//      * Отправитель - Справочник.Организации - Организация.
//      * Получатель - Справочник.Контрагенты - Контрагент.
//      * ВидДокумента - Справочник.ВидыВнутреннихДокументов - Вид внутреннего документа.
//      * Отправлять - Булево - возможно ли отправлять по ЭДО этот вид документов.
//      * ВидДокументаЭДО - Справочник.ВидыДокументовЭДО - Вид документа, которым будет отправлен документ.
//      * ВидЭД - Перечисление.ВидыЭД - Вид ЭД, которым будет отправлен документ.
//      * ТипЭД - Перечисление.ТипыЭД - Тип ЭД, которым будет отправлен документ.
//      * ТребуетсяОтветнаяПодпись - Булево - Требовать ответную подпись.
//      * ТребуетсяИзвещениеОПолучении - Булево - Требовать извещение о получении.
Функция НастройкиОтправкиДокументовПоЭДО(Организация, Контрагент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	ОписаниеТипаФормата = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	
	ИсходящиеДокументы = Новый ТаблицаЗначений;
	
	ИсходящиеДокументы.Колонки.Добавить("Отправитель"                  , Метаданные.ОпределяемыеТипы.Организация.Тип);
	ИсходящиеДокументы.Колонки.Добавить("Получатель"                   , Метаданные.ОпределяемыеТипы.УчастникЭДО.Тип);
	ИсходящиеДокументы.Колонки.Добавить("ВидДокумента"                 , Новый ОписаниеТипов("СправочникСсылка.ВидыВнутреннихДокументов"));
	
	ИсходящиеДокументы.Колонки.Добавить("Отправлять"                   , ОписаниеТипаБулево);
	ИсходящиеДокументы.Колонки.Добавить("ВидДокументаЭДО"              , Новый ОписаниеТипов("СправочникСсылка.ВидыДокументовЭДО"));
	ИсходящиеДокументы.Колонки.Добавить("ВидЭД"                        , Новый ОписаниеТипов("ПеречислениеСсылка.ТипыДокументовЭДО"));
	ИсходящиеДокументы.Колонки.Добавить("ТипЭД"                        , Новый ОписаниеТипов("ПеречислениеСсылка.УдалитьТипыПроизвольныхДокументовЭДО"));
	ИсходящиеДокументы.Колонки.Добавить("ТребуетсяОтветнаяПодпись"     , ОписаниеТипаБулево);
	ИсходящиеДокументы.Колонки.Добавить("ТребуетсяИзвещениеОПолучении" , ОписаниеТипаБулево);
	ИсходящиеДокументы.Колонки.Добавить("Формат"                       , ОписаниеТипаФормата);
	
	ВидыДокументов = ОбменСКонтрагентамиДОСлужебный.ВидыДокументовДляОтправкиПоЭДО();
	
	Для Каждого ВидДокумента Из ВидыДокументов Цикл
		НоваяСтрока = ИсходящиеДокументы.Добавить();
		
		НоваяСтрока.Отправитель = Организация;
		НоваяСтрока.Получатель = Контрагент;
		НоваяСтрока.ВидДокумента = ВидДокумента;
		
		НоваяСтрока.Отправлять = Ложь;
		НоваяСтрока.ВидДокументаЭДО = Справочники.ВидыДокументовЭДО.ПустаяСсылка();
		НоваяСтрока.ВидЭД = Перечисления.ТипыДокументовЭДО.ПустаяСсылка();
		НоваяСтрока.ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.Прочее;
		НоваяСтрока.ТребуетсяОтветнаяПодпись = Истина;
		НоваяСтрока.ТребуетсяИзвещениеОПолучении = Истина;
		НоваяСтрока.Формат = "";
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиОтправкиДокументовПоЭДО.ВидДокумента КАК ВидДокумента,
		|	НастройкиОтправкиДокументовПоЭДО.Отправлять КАК Отправлять,
		|	НастройкиОтправкиДокументовПоЭДО.ВидДокументаЭДО КАК ВидДокументаЭДО,
		|	НастройкиОтправкиДокументовПоЭДО.УдалитьВидЭД КАК ВидЭД,
		|	НастройкиОтправкиДокументовПоЭДО.УдалитьТипЭД КАК ТипЭД,
		|	НастройкиОтправкиДокументовПоЭДО.ТребуетсяОтветнаяПодпись КАК ТребуетсяОтветнаяПодпись,
		|	НастройкиОтправкиДокументовПоЭДО.ТребуетсяИзвещениеОПолучении КАК ТребуетсяИзвещениеОПолучении,
		|	НастройкиОтправкиДокументовПоЭДО.Формат КАК Формат
		|ИЗ
		|	РегистрСведений.НастройкиОтправкиДокументовПоЭДО КАК НастройкиОтправкиДокументовПоЭДО
		|ГДЕ
		|	НастройкиОтправкиДокументовПоЭДО.Отправитель = &Организация
		|	И НастройкиОтправкиДокументовПоЭДО.Получатель = &Контрагент";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура("ВидДокумента", Выборка.ВидДокумента);
		СтрокиНастроек = ИсходящиеДокументы.НайтиСтроки(Отбор);
		
		Для Каждого СтрокаНастроек Из СтрокиНастроек Цикл
			ЗаполнитьЗначенияСвойств(СтрокаНастроек, Выборка, , "ВидДокумента");
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ИсходящиеДокументы;
	
КонецФункции

Функция НастройкиОтправкиВидаДокумента(Организация, Контрагент, ВидДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиОтправкиДокументовПоЭДО.ВидДокументаЭДО КАК ВидДокументаЭДО,
		|	НастройкиОтправкиДокументовПоЭДО.УдалитьВидЭД КАК ВидЭД,
		|	НастройкиОтправкиДокументовПоЭДО.УдалитьТипЭД КАК ТипЭД,
		|	НастройкиОтправкиДокументовПоЭДО.ТребуетсяОтветнаяПодпись КАК ТребуетсяОтветнаяПодпись,
		|	НастройкиОтправкиДокументовПоЭДО.ТребуетсяИзвещениеОПолучении КАК ТребуетсяИзвещениеОПолучении,
		|	ЕСТЬNULL(ВидыДокументовЭДО.ТипДокумента, ЗНАЧЕНИЕ(Перечисление.ТипыДокументовЭДО.ПустаяСсылка)) КАК ТипДокумента,
		|	НастройкиОтправкиДокументовПоЭДО.Формат КАК Формат
		|ИЗ
		|	РегистрСведений.НастройкиОтправкиДокументовПоЭДО КАК НастройкиОтправкиДокументовПоЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|		ПО НастройкиОтправкиДокументовПоЭДО.ВидДокументаЭДО = ВидыДокументовЭДО.Ссылка
		|ГДЕ
		|	НастройкиОтправкиДокументовПоЭДО.Отправитель = &Организация
		|	И НастройкиОтправкиДокументовПоЭДО.Получатель = &Контрагент
		|	И НастройкиОтправкиДокументовПоЭДО.ВидДокумента = &ВидДокумента
		|	И НастройкиОтправкиДокументовПоЭДО.Отправлять";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		
		НастройкиОтправки = Новый Структура("ВидДокументаЭДО, ВидЭД, ТипЭД, ТребуетсяОтветнаяПодпись,
			|ТребуетсяИзвещениеОПолучении, ТипДокумента, Формат");
		ЗаполнитьЗначенияСвойств(НастройкиОтправки, Выборка);
		
		Возврат НастройкиОтправки;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьВидДокументаЭДОПриОбновлении(НаборЗаписей, СоответствиеВидовДокументов, Записывать)
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		Если Запись.УдалитьВидЭД = Перечисления.ТипыДокументовЭДО.ПустаяСсылка() Тогда
			Если Запись.УдалитьТипЭД <> Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.Прочее Тогда
				ТипЭДО = ТипЭДОПоТипуПроизвольногоЭД(Запись.УдалитьТипЭД);
			Иначе
				Продолжить;
			КонецЕсли;
		ИначеЕсли Запись.УдалитьВидЭД = Перечисления.ТипыДокументовЭДО.УдалитьПроизвольный Тогда
			ТипЭДО = ТипЭДОПоТипуПроизвольногоЭД(Запись.УдалитьТипЭД);
		Иначе
			ТипЭДО = Запись.УдалитьВидЭД;
		КонецЕсли;
		
		ВидДокументаЭДО = СоответствиеВидовДокументов.Получить(ТипЭДО);
		
		Если ВидДокументаЭДО <> Неопределено Тогда
			Запись.ВидДокументаЭДО = ВидДокументаЭДО;
			Записывать = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТипЭДОПоТипуПроизвольногоЭД(ТипЭД)
	
	Если ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.АктВзаимозачета Тогда
		Возврат Перечисления.ТипыДокументовЭДО.АктВзаимозачета;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.АктВыполненныхРабот Тогда
		Возврат Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.АктСверки Тогда
		Возврат Перечисления.ТипыДокументовЭДО.АктСверки;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.Ведомость Тогда
		Возврат Перечисления.ТипыДокументовЭДО.Ведомость;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.ГарантийноеПисьмо Тогда
		Возврат Перечисления.ТипыДокументовЭДО.ГарантийноеПисьмо;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.Договор Тогда
		Возврат Перечисления.ТипыДокументовЭДО.Договор;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.ДополнительноеСоглашение Тогда
		Возврат Перечисления.ТипыДокументовЭДО.ДополнительноеСоглашение;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.КС11 Тогда
		Возврат Перечисления.ТипыДокументовЭДО.КС11;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.КС2 Тогда
		Возврат Перечисления.ТипыДокументовЭДО.КС2;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.КС3 Тогда
		Возврат Перечисления.ТипыДокументовЭДО.КС3;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.Отчет Тогда
		Возврат Перечисления.ТипыДокументовЭДО.Отчет;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.ПлатежноеПоручение Тогда
		Возврат Перечисления.ТипыДокументовЭДО.ПлатежноеПоручение;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.ПриложениеКАкту Тогда
		Возврат Перечисления.ТипыДокументовЭДО.ПриложениеКАкту;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.Прочее Тогда
		Возврат Перечисления.ТипыДокументовЭДО.Прочее;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.СоглашениеОбЭДО Тогда
		Возврат Перечисления.ТипыДокументовЭДО.СоглашениеОбЭДО;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.Спецификация Тогда
		Возврат Перечисления.ТипыДокументовЭДО.Спецификация;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.СчетНаОплату Тогда
		Возврат Перечисления.ТипыДокументовЭДО.СчетНаОплату;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.ТоварнаяНакладная Тогда
		Возврат Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
	ИначеЕсли ТипЭД = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.Уведомление Тогда
		Возврат Перечисления.ТипыДокументовЭДО.Уведомление;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
